// 004_Var.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
	// 이안에 내용을 적음으로써 프로그램이 만들어지게 된다.

	// 숫자 선언

	// 함수의 시작과 함수의 끝 사이를
	// 스코프 혹은 지역이라고 한다.

	// 지역에 선언된 숫자
	// 지역에 선언된 메모리
	10; // 고정된 숫자 : 상수

	// 정의된 상태 <= C++ 표준에서
	// 열거형
	// 사용자 정읮 ㅏ료형
	// 정수형 int
	// 실수형
	// 논리형

	// 이런 형들에는 
	// 그것을 표현하기 위한 자료형이 있고
	// 그 다음에 이름을 붙여주는 것이 기본이다.

	// 자료형 이름
	   int Att;
	   int Def;

	   


	// 자료형의 의미
	// 1. 바이트의 크기 int 는 4bite이다.
	// 2. 처리형태 <= 그리고 정수다.
	// 
	// 이름이 의미하는 것
	// 1. 위치 <= 내 프로그램의 시작위치에서 n(계속 바뀌는)번째 바이트에서 시작한다.

}


// 램
// 비트로 이루어진 유한한 선
// 
// 
//
//

